
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/ikigaikintore/ikigaikintore/actions/runs/7640513432)



<pre><code>Apply complete! Resources: 1 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
[command]/home/runner/work/_temp/d136ae91-e3b2-450b-b9b8-df47d0e84e34/terraform-bin apply -input=false -auto-approve -lock=false -no-color
google_service_account.gitops-sa: Refreshing state... [id=projects/gig-japan-398904/serviceAccounts/terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]
google_iam_workload_identity_pool.gitops-github-identity-pool: Refreshing state... [id=projects/gig-japan-398904/locations/global/workloadIdentityPools/gitops-github]
google_project_service.api-resources["artifactregistry.googleapis.com"]: Refreshing state... [id=gig-japan-398904/artifactregistry.googleapis.com]
google_project_iam_member.gitops-sa-roles["roles/secretmanager.admin"]: Refreshing state... [id=gig-japan-398904/roles/secretmanager.admin/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]
google_project_iam_member.gitops-sa-roles["roles/artifactregistry.admin"]: Refreshing state... [id=gig-japan-398904/roles/artifactregistry.admin/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]
google_project_iam_member.gitops-sa-roles["roles/editor"]: Refreshing state... [id=gig-japan-398904/roles/editor/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]
google_iam_workload_identity_pool_provider.gitops-github-pool-provider: Refreshing state... [id=projects/gig-japan-398904/locations/global/workloadIdentityPools/gitops-github/providers/gitops-github-pool]
google_project_iam_member.gitops-sa-binding: Refreshing state... [id=gig-japan-398904/roles/iam.workloadIdentityUser/principal://iam.googleapis.com/projects/139527520332/locations/global/workloadIdentityPools/gitops-github/subject/ikigaikintore/ikigaikintore]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_artifact_registry_repository.artifact-repository will be created
  + resource "google_artifact_registry_repository" "artifact-repository" {
      + create_time      = (known after apply)
      + effective_labels = (known after apply)
      + format           = "DOCKER"
      + id               = (known after apply)
      + location         = "asia-northeast1"
      + mode             = "STANDARD_REPOSITORY"
      + name             = (known after apply)
      + project          = "gig-japan-398904"
      + repository_id    = "ikigai"
      + terraform_labels = (known after apply)
      + update_time      = (known after apply)

      + docker_config {
          + immutable_tags = true
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
google_artifact_registry_repository.artifact-repository: Creating...
google_artifact_registry_repository.artifact-repository: Still creating... [10s elapsed]
google_artifact_registry_repository.artifact-repository: Creation complete after 13s [id=projects/gig-japan-398904/locations/asia-northeast1/repositories/ikigai]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
::debug::Terraform exited with code 0.
::debug::stdout: google_service_account.gitops-sa: Refreshing state... [id=projects/gig-japan-398904/serviceAccounts/terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_iam_workload_identity_pool.gitops-github-identity-pool: Refreshing state... [id=projects/gig-japan-398904/locations/global/workloadIdentityPools/gitops-github]%0Agoogle_project_service.api-resources["artifactregistry.googleapis.com"]: Refreshing state... [id=gig-japan-398904/artifactregistry.googleapis.com]%0Agoogle_project_iam_member.gitops-sa-roles["roles/secretmanager.admin"]: Refreshing state... [id=gig-japan-398904/roles/secretmanager.admin/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.gitops-sa-roles["roles/artifactregistry.admin"]: Refreshing state... [id=gig-japan-398904/roles/artifactregistry.admin/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.gitops-sa-roles["roles/editor"]: Refreshing state... [id=gig-japan-398904/roles/editor/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_iam_workload_identity_pool_provider.gitops-github-pool-provider: Refreshing state... [id=projects/gig-japan-398904/locations/global/workloadIdentityPools/gitops-github/providers/gitops-github-pool]%0Agoogle_project_iam_member.gitops-sa-binding: Refreshing state... [id=gig-japan-398904/roles/iam.workloadIdentityUser/principal://iam.googleapis.com/projects/139527520332/locations/global/workloadIdentityPools/gitops-github/subject/ikigaikintore/ikigaikintore]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # google_artifact_registry_repository.artifact-repository will be created%0A  + resource "google_artifact_registry_repository" "artifact-repository" {%0A      + create_time      = (known after apply)%0A      + effective_labels = (known after apply)%0A      + format           = "DOCKER"%0A      + id               = (known after apply)%0A      + location         = "asia-northeast1"%0A      + mode             = "STANDARD_REPOSITORY"%0A      + name             = (known after apply)%0A      + project          = "gig-japan-398904"%0A      + repository_id    = "ikigai"%0A      + terraform_labels = (known after apply)%0A      + update_time      = (known after apply)%0A%0A      + docker_config {%0A          + immutable_tags = true%0A        }%0A    }%0A%0APlan: 1 to add, 0 to change, 0 to destroy.%0Agoogle_artifact_registry_repository.artifact-repository: Creating...%0Agoogle_artifact_registry_repository.artifact-repository: Still creating... [10s elapsed]%0Agoogle_artifact_registry_repository.artifact-repository: Creation complete after 13s [id=projects/gig-japan-398904/locations/asia-northeast1/repositories/ikigai]%0A%0AApply complete! Resources: 1 added, 0 changed, 0 destroyed.%0A
::debug::stderr: 
::debug::exitcode: 0

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform_apply","PRNumber":15,"Program":"tfcmt","SHA1":"0a5442b11a52693d59d5643846e2f6288a844275","Vars":{},"WorkflowName":"iaac_apply"} -->